---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SplitSketchBasedElementFailures.NotSplitValidRegions
source: html/44f03586-bdcc-7c54-8da1-8e3e09159f7a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SplitSketchBasedElementFailures.NotSplitValidRegions Property

The split failed. There may be a gap in the boundary loop or the sketch may be incomplete.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotSplitValidRegions { get; }
```